<script>
export default {
  name: "Reviews",
  data() {
    let reviews = [
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
      {
        date: '19.03.2024',
        name: 'Viktor Wagner',
        items: [
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 1
          },
          {
            text: 'Дружелюбный, вежливый персонал. Хорошее, центральное расположение отеля. Приложения, способствующие укреплению здоровья. Вкусная еда. Можно рекомендовать.',
            type: 0
          }
        ]
      },
    ]

    return {
      reviews
    }
  },

}
</script>

<template>
  <div class="reviews">
    <div class="wrapper">
      <div class="reviews-header">
        Отзывы
      </div>
      <div class="reviews-items">
        <div
            class="reviews-item"
            v-for="item in reviews"
        >
          <div class="reviews-item-header">
            <div class="name">
              {{ item.name }}
            </div>
            <div class="date">
              {{ item.date }}
            </div>
          </div>
          <div class="text-container" v-for="review in item.items">
            <h3
                :class="{
                  positive: review.type === 1,
                  negative: review.type === 0
                }"
            >
              <svg v-if="review.type === 1" id="thumbs-up" viewBox="0 0 42 38" width="16px" fill="#48C014">
                <path d="M24.66 1.338 13.348 12.757a.96.96 0 0 1-.101.089c-.458.346-.77.982-.77 1.938v19.31c0 1.596 1.298 2.906 2.88 2.906h17.216c1.13 0 2.138-.716 2.572-1.735l.001-.003 5.737-13.705.012-.028.014-.028c.02-.04.052-.146.072-.343.018-.187.019-.383.019-.58v-3.863c0-1.662-1.169-2.906-2.688-2.906H27.048a1.588 1.588 0 0 1-1.542-1.936c.234-1.067.67-3.053 1.047-4.793.188-.87.362-1.676.488-2.275.097-.46.061-.965-.087-1.411-.258-.78-.661-1.959-.866-2.148-.37-.342-.998-.342-1.428.092ZM1 18.62V34.12a2.879 2.879 0 0 0 5.758 0V18.619a2.879 2.879 0 0 0-5.758 0Z" stroke="currentColor"/>
              </svg>
              <svg v-else id="thumbs-down" viewBox="0 0 42 38" width="16px" fill="#ED7F7F">
                <path d="M24.66 1.338 13.348 12.757a.96.96 0 0 1-.101.089c-.458.346-.77.982-.77 1.938v19.31c0 1.596 1.298 2.906 2.88 2.906h17.216c1.13 0 2.138-.716 2.572-1.735l.001-.003 5.737-13.705.012-.028.014-.028c.02-.04.052-.146.072-.343.018-.187.019-.383.019-.58v-3.863c0-1.662-1.169-2.906-2.688-2.906H27.048a1.588 1.588 0 0 1-1.542-1.936c.234-1.067.67-3.053 1.047-4.793.188-.87.362-1.676.488-2.275.097-.46.061-.965-.087-1.411-.258-.78-.661-1.959-.866-2.148-.37-.342-.998-.342-1.428.092ZM1 18.62V34.12a2.879 2.879 0 0 0 5.758 0V18.619a2.879 2.879 0 0 0-5.758 0Z" stroke="currentColor"/>
              </svg>

              {{ review.type === 1 ? 'Позитив' : 'Негатив'}}
            </h3>
            <span>
              {{ review.text }}
            </span>
          </div>
        </div>
      </div>
    </div>
  </div>

</template>

<style scoped>
.reviews {
  margin-top: 30px;
}
.reviews-header {
  font-size: 28px;
  margin-bottom: 20px;
  color: #333;
}

.reviews-items {

}

.reviews-item {
  padding: 30px;
  background-color: #F7F7F9;
  margin-bottom: 30px;
}

.reviews-item-header {
  display: flex;
  justify-content: space-between;
}

.name {
  font-size: 15px;
  font-family: roboto-medium,Arial,sans-serif;
  font-weight: 600;
  color: #333;
  margin-bottom: 15px;
}

.date {
  color: #333;
  font-size: 15px;
}

.text-container {
  margin-bottom: 20px;
}

.text-container span {
  font-size: 15px;
  line-height: 1.7;
  overflow-wrap: break-word;
  font-family: roboto,Arial,sans-serif;
  color: #333;
  font-weight: 400;
}

.text-container h3{
  display: flex;
  margin-bottom: 20px;
}

.text-container svg {
  margin-right: 10px;
}

.positive {
  color: #48C014;
  font-family: roboto-medium,Arial,sans-serif;
}

.negative {
  color: #ED7F7F;
  font-family: roboto-medium,Arial,sans-serif;
}

#thumbs-down {
  transform: scaleY(-1);
}

</style>