export const servicesData = [
    {id: 1, name: 'Активный отдых и спорт', serviceInfo: [
            {text: 'Спортивные площадки на территории отеля'},
            {text: 'Детская площадка'},
            {text: 'Фитнесс центр'},
        ]},
    {id: 2, name: 'Удобства',  serviceInfo: [
            {text: 'парковка'},
            {text: 'Нафталановые ванны'},
            {text: 'ресторан (курортный ресторан «Кривань» (открыт в часы сервировки завтрака, обеда и ужина, общая вместительность 57 мест), ресторан «Бернард» (ежедневно, 11:30–22:00), есть собственная кондитерская)'},
            {text: 'Диагностика - "Check-Up"'},
        ]},
    {id: 3, name: 'Питание',  serviceInfo: [
            {text: 'диетические блюда (основные типы диет: щадящая, рациональная, с ограничением жиров, разгрузочная, для диабетиков, безглютеновая)'},
            {text: 'завтрак "шведский стол" (07:30–09:30)'},
            {text: 'обед по выбору из меню (11:45–13:30)'},
            {text: 'ужин по выбору из меню (17:30–19:00)'},
        ]},
    {
        id:4, name: 'Языки общения персонала', serviceInfo:  [
            {text: 'русский'},
            {text: 'чешский'},
            {text: 'немецкий'},
            {text: 'английский'},
        ]
    }
];